{
    "format": "layers-model",
    "generatedBy": "keras v3.10.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "trainable": true,
                "dtype": "float32",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batchInputShape": [
                                null,
                                15
                            ],
                            "dtype": "float32",
                            "name": "input_layer_2"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_6",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 32,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {}
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {}
                            }
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_2",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_7",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 16,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {}
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {}
                            }
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_8",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {}
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {}
                            }
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.001
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_6/kernel",
                    "shape": [
                        15,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_6/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_7/kernel",
                    "shape": [
                        32,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_7/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_8/kernel",
                    "shape": [
                        16,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_8/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}