{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": {
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "shared_object_id": 137518038171616
        },
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                }
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "batchInputShape": [
                null,
                15
              ]
            },
            "build_config": {
              "input_shape": [
                null,
                15
              ]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": {
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "shared_object_id": 137518038171616
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": {
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "shared_object_id": 137518038171616
              },
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "build_config": {
              "input_shape": [
                null,
                32
              ]
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": {
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "shared_object_id": 137518038171616
              },
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "build_config": {
              "input_shape": [
                null,
                16
              ]
            }
          }
        ],
        "build_input_shape": [
          null,
          15
        ]
      },
      "build_config": {
        "input_shape": [
          null,
          15
        ]
      },
      "compile_config": {
        "optimizer": {
          "class_name": "Adam",
          "config": {
            "name": "adam",
            "learning_rate": 0.0010000000474974513,
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null,
            "loss_scale_factor": null,
            "gradient_accumulation_steps": null,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-07,
            "amsgrad": false
          }
        },
        "loss": "binary_crossentropy",
        "loss_weights": null,
        "metrics": [
          "accuracy"
        ],
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": false
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "layers/dense/vars/0",
          "shape": [
            15,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "layers/dense/vars/1",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "layers/dense_1/vars/0",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "layers/dense_1/vars/1",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "layers/dense_2/vars/0",
          "shape": [
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "layers/dense_2/vars/1",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/0",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "optimizer/vars/1",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/10",
          "shape": [
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/11",
          "shape": [
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/12",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/13",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/2",
          "shape": [
            15,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/3",
          "shape": [
            15,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/4",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/5",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/6",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/7",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/8",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "optimizer/vars/9",
          "shape": [
            16
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}